app/commands/recipes/show.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."step_id" = ?  [["step_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "steps".* FROM "steps" WHERE "steps"."recipe_id" = ?  [["recipe_id", 1]]
---
    def cooking_mode
      recipe = Recipe.includes(:steps, :ingredients, :author).find(recipe_params[:id])