app/controllers/api/v1/ratings_controller.rb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."recipe_id" = ?  [["recipe_id", 1]]
---
  def index
    @ratings = Rating.where(recipe_id: params[:recipe_id])

INSERT INTO "ratings" ("comment", "rate_value", "recipe_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "string"], ["rate_value", 5], ["recipe_id", 1], ["user_id", 3], ["created_at", "2022-08-14 23:54:23.434199"], ["updated_at", "2022-08-14 23:54:23.434199"]]
---
  def create
    @rating = Rating.new(rating_params)

    respond_to do |format|
      if @rating.save