app/controllers/api/v1/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("name", "notes", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "string"], ["notes", "string"], ["user_id", 1], ["created_at", "2022-08-14 04:47:15.414040"], ["updated_at", "2022-08-14 04:47:15.414040"]]